const jake = {
    nickname: "jake"
}

// jake.hello();

// [1,2,3,4] + false;

function divide(a, b)
{
    return a/ b;
}

divide(42);


// const player ={
//     age:12
// }

// player.age = false;
// // Nodejs도 자스
// 브라우저는 타입스크립트를 못읽어줌
// 타입 스크립트가 어떻게 보호해주는 것일까?
// 커파일은 타스를 자스로 바꾸어줌
// 자스는 불안정함
// 타스를 제공하는 보호장치는 타스 코드가 자스로 변환되기 전에 발생 
// 타스는 먼저 우리의 코드를 환인한뒤 변환된 자스 안에서 바보같으 시수가 일어낭아헥 확인함
// 타스는 코드를 작성해서
// 그 코드를 컴파일하면 보호 장치 없는 크레이지 자스 코드
// 타스 코드에 에러가 있으면 그 코드는 자슥

// 타스작서앟여 컴파일하면 자스가 됨
// 템플릿 프로그래밍 같은 

// 타스 코드에 에러가 있으면 그 코드는 자스로 컴파일 되지 않음
// 타스는 코드 에러가 있으면 컴파일하지 않음
// 타스는 에러가 발생할것ㅇ같은 코드를 ㅋ검색
// 자바는 아예 컴파일하지 않음
// 보호장치는 유저가 코드를 실
